In [1]:
import pandas as pd
import numpy as np

In [6]:
df = pd.DataFrame({'col 1': [1,2,3,4],
                   'col 2': [12,22,32,42],
                   'col 3': ['a0', 'b0', 'c0', 'd0']})

In [7]:
df

   col 1  col 2 col 3
0      1     12    a0
1      2     22    b0
2      3     32    c0
3      4     42    d0

In [8]:
df.head(2)

   col 1  col 2 col 3
0      1     12    a0
1      2     22    b0

In [10]:
len(df['col 2'].unique())

4

In [19]:
df['col 2'][3] = 12

/home/follia/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [20]:
df

   col 1  col 2 col 3
0      1     12    a0
1      2     22    b0
2      3     32    c0
3      4     12    d0

In [21]:
df['col 2'].unique()

array([12, 22, 32])

In [22]:
df['col 2'].nunique()

3

In [24]:
df['col 2'].value_counts()

12    2
22    1
32    1
Name: col 2, dtype: int64

In [31]:
df['col 2'].value_counts()

12    2
22    1
32    1
Name: col 2, dtype: int64

In [35]:
df[df['col 2'] > 20]

   col 1  col 2 col 3
1      2     22    b0
2      3     32    c0

In [36]:
df[(df['col 2'] > 20) & (df['col 2'] // 2)]

   col 1  col 2 col 3
1      2     22    b0

In [37]:
df['col 2'].sum()

78

In [39]:
df['col 2']

0    12
1    22
2    32
3    12
Name: col 2, dtype: int64

In [40]:
def squared(x):
    return x**2

In [41]:
df['col 2'].apply(squared)

0     144
1     484
2    1024
3     144
Name: col 2, dtype: int64

In [43]:
np.mean(df['col 2'])

19.5

In [52]:
df['col 3'].apply(len)

0    2
1    2
2    2
3    2
Name: col 3, dtype: int64

In [53]:
df['col 2'].apply(float)

0    12.0
1    22.0
2    32.0
3    12.0
Name: col 2, dtype: float64

In [58]:
df['col 3'].apply(lambda x : (x + ' ') * 2)

0    a0 a0
1    b0 b0
2    c0 c0
3    d0 d0
Name: col 3, dtype: object

In [63]:
df.drop('col 1', axis = 1)

   col 2 col 3
0     12    a0
1     22    b0
2     32    c0
3     12    d0

In [64]:
df.columns

Index(['col 1', 'col 2', 'col 3'], dtype='object')

In [66]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [72]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [73]:
df.index.max()

3

In [90]:
ind = ['zero', 'one', 'two', 'three']

In [98]:
df.index = ind

In [99]:
df

       col 1  col 2 col 3
zero       1     12    a0
one        2     22    b0
two        3     32    c0
three      4     12    d0

In [104]:
df.sort_values(by ='col 2', ascending = False)

       col 1  col 2 col 3
two        3     32    c0
one        2     22    b0
zero       1     12    a0
three      4     12    d0